
## Improving my Pandas skill with materials from Hamoye.AI and Huntsman School of Business, Utah State University 

# Pandas 

My Practice explored:

1. Series
2. DataFrames
3. Missing Variables
4. Operations
5. Data import and export

i will be working with the pandas cheatsheet provided by Huntsman

## 1. Series

Series are very similar to NumPy arrays. The difference is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. We can convert a list,numpy array, or dictionary to a Series.

In [1]:
import numpy as np #Importing the numpy library using the popular convetion np
import pandas as pd #Importing the pandas library using its popular convetion also, i.e pd

In [2]:
my_list = [1,2,3] #created a python list with 3 elements
my_list

[1, 2, 3]

In [3]:
'''The Series class can be used as thus:
pd.Series(
    data=None,
    index=None,
    dtype: 'Dtype | None' = None,
    name=None,
    copy: 'bool | None' = None,
    fastpath: 'bool' = False,
)'''

"The Series class can be used as thus:\npd.Series(\n    data=None,\n    index=None,\n    dtype: 'Dtype | None' = None,\n    name=None,\n    copy: 'bool | None' = None,\n    fastpath: 'bool' = False,\n)"

In [4]:
pd.Series(data=my_list)  #Passed the data paramter here which is a python list

0    1
1    2
2    3
dtype: int64

In [5]:
labels = ['a','b','c'] #Created another list which will serve as our label for the series
pd.Series(data=my_list,index=labels) #used here, data and index parameter passed into the series class

#It will result to a pandas series, the index value then the data value i.e a   1

a    1
b    2
c    3
dtype: int64

In [6]:
my_array = np.array([1,2,3]) #a number array is used created here and store to variable
pd.Series(my_array) #used the series class to convert the numoy array to a pandas series also
#Because no parameter is passed for the index argument, it uses dafult which is integer number from Zero as seen below

0    1
1    2
2    3
dtype: int32

In [7]:
pd.Series(my_array,labels) #HEre, passed the label list as argument for the index parameter labels = ['a','b','c']

a    1
b    2
c    3
dtype: int32

In [8]:
my_dict = {'a':1,'b':2,'c':3} #Here i use python dictionary, 
pd.Series(my_dict) #to create a series from the dictionary, pandas picked the dictionary key as index argument for series class
#then picked value as data argument for the series class
#remember, the python dictionary syntax is my_dict = {'key1':value1, 'key2':value2, key3':value3}

a    1
b    2
c    3
dtype: int64

In [9]:
my_series = pd.Series(my_dict)
my_series

a    1
b    2
c    3
dtype: int64

In [10]:
# unlike dictionaries, i can extract info out a pandas  by index number and label
#Extracing by index, it will return the value of the index called
my_series[0]

1

In [11]:
#Extracing by label, it will return the value of the label called
my_series['a']

#THis is another advantage of pandas series over python list, dictionary and numpy array as value can only be accessed out of them in one way

1

## 2. DataFrames

DataFrames are directly inspired by the R programming language and are the workhorse of pandas.

In [12]:
np.random.seed(100)  # do this if you want to see the same results as mine

In [82]:
#A Pandas Dataframe is a two-dimensional size-mutable, tabular data structure with columns of potentially different types.
#Note that the dataframe class to call is case sentitive, i.e pd.DataFrame, and not pd.dataframe ot whatsoever
# it takes aout 5 parameter, data, index, column, dtype, copy. Read documentation for more to Contextual Help with Ctrl + i

df = pd.DataFrame(data= np.random.rand(4,4),index='A B C D'.split(),columns='W X Y Z'.split())
#data here is np.random.randn(4,4) ie.generate a 4 by 4 matrix with random numbers filles in each cell 
# THe index is a, b, c, d wfor the frame, the split method is used to split the abcd string
#Same approach in index happens in the column parameteralso
df #THis df means same as pd.DataFrame

          W         X         Y         Z
A  0.285896  0.852395  0.975006  0.884853
B  0.359508  0.598859  0.354796  0.340190
C  0.178081  0.237694  0.044862  0.505431
D  0.376252  0.592805  0.629942  0.142600

In [83]:
df.describe() #We can use the describe method to generate descriptive statistics  of dataframe its applied on

#The statistics include, count, mean, stf, min, max, and percentile

              W         X         Y         Z
count  4.000000  4.000000  4.000000  4.000000
mean   0.299934  0.570438  0.501152  0.468269
std    0.090220  0.252670  0.396125  0.314848
min    0.178081  0.237694  0.044862  0.142600
25%    0.258942  0.504028  0.277312  0.290793
50%    0.322702  0.595832  0.492369  0.422811
75%    0.363694  0.662243  0.716208  0.600287
max    0.376252  0.852395  0.975006  0.884853

In [84]:
df.info() #Used to print a consise summary of a DataFrame, like total index, column.

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       4 non-null      float64
 1   X       4 non-null      float64
 2   Y       4 non-null      float64
 3   Z       4 non-null      float64
dtypes: float64(4)
memory usage: 160.0+ bytes

In [85]:
df.describe().transpose() #Generate the transpose of the result of the describe method              
# or equivalently, df.describe().T

   count      mean       std       min       25%       50%       75%       max
W    4.0  0.299934  0.090220  0.178081  0.258942  0.322702  0.363694  0.376252
X    4.0  0.570438  0.252670  0.237694  0.504028  0.595832  0.662243  0.852395
Y    4.0  0.501152  0.396125  0.044862  0.277312  0.492369  0.716208  0.975006
Z    4.0  0.468269  0.314848  0.142600  0.290793  0.422811  0.600287  0.884853

### Indexing and extraction

In [86]:
df #Just decided to bring back her the datafrME TO ASSIST VISABILITY

          W         X         Y         Z
A  0.285896  0.852395  0.975006  0.884853
B  0.359508  0.598859  0.354796  0.340190
C  0.178081  0.237694  0.044862  0.505431
D  0.376252  0.592805  0.629942  0.142600

In [87]:
df['W']    #Access the W column from the dataframe
#Take note, it returns the accessed data in a list, just python list datatype

A    0.285896
B    0.359508
C    0.178081
D    0.376252
Name: W, dtype: float64

In [88]:
df[['W']] #Access the W column from the dataframe 
#Notice the double squre bracket
#THis is the normal indexing approach, it wil return the access column or data as a dataframe.
#The advantage of using this approach is that, it  will make it possible to use the accessed as a dataframe
#dataframe method will  continue to work on it
#While what we want to use the extracted data can determine which approach to use, no one is better then, use cases determines.

          W
A  0.285896
B  0.359508
C  0.178081
D  0.376252

In [89]:
df[['W','Y']] #Using that approach to access 2 columns
#Beacuse of the 2 [[]], it return it pandas dataframe also

          W         Y
A  0.285896  0.975006
B  0.359508  0.354796
C  0.178081  0.044862
D  0.376252  0.629942

In [90]:
#With this, created a new column named 'new', and the data of the new will be addition of the column W and Y
df['W + Y'] = df['W'] + df['Y']

df  #Worked, as seen in the result, a new column is create with cells having the sum of their corresponing W and Y column

          W         X         Y         Z     W + Y
A  0.285896  0.852395  0.975006  0.884853  1.260902
B  0.359508  0.598859  0.354796  0.340190  0.714303
C  0.178081  0.237694  0.044862  0.505431  0.222943
D  0.376252  0.592805  0.629942  0.142600  1.006194

In [91]:
#to create something like that for row also, 
#i mean creating a new row with cell value being corresponding sum of row A and row B
#df[,'new index'] = df[:'A'] + df[:'B']...... something  like this following the approach used to add column wont work
#We would be needing to use some methods here as used melow

df.loc['A + B'] = df.loc[['A', 'B']].sum().values

#    df.loc['new row']: We're adding a new row labeled "new row" to the DataFrame df.

#    df.loc[['A', 'B']]: We're selecting rows "A" and "B" from the DataFrame df.

#    .sum(): We're calculating the sum of values in each column for the selected rows "A" and "B."

#    .values: We're extracting the calculated sums as a NumPy array.

df

              W         X         Y         Z     W + Y
A      0.285896  0.852395  0.975006  0.884853  1.260902
B      0.359508  0.598859  0.354796  0.340190  0.714303
C      0.178081  0.237694  0.044862  0.505431  0.222943
D      0.376252  0.592805  0.629942  0.142600  1.006194
A + B  0.645404  1.451254  1.329802  1.225044  1.975206

In [92]:
df

              W         X         Y         Z     W + Y
A      0.285896  0.852395  0.975006  0.884853  1.260902
B      0.359508  0.598859  0.354796  0.340190  0.714303
C      0.178081  0.237694  0.044862  0.505431  0.222943
D      0.376252  0.592805  0.629942  0.142600  1.006194
A + B  0.645404  1.451254  1.329802  1.225044  1.975206

In [93]:
df.drop('A',axis=0) #Drop method is used to drop specified labels from rows or columns. 
#Here, drop if axix = 0 , menas dropping index
# If axis = 1, means droping column
#Remove rows or columns by specifying label names and corresponding axis

              W         X         Y         Z     W + Y
B      0.359508  0.598859  0.354796  0.340190  0.714303
C      0.178081  0.237694  0.044862  0.505431  0.222943
D      0.376252  0.592805  0.629942  0.142600  1.006194
A + B  0.645404  1.451254  1.329802  1.225044  1.975206

In [95]:
df

              W         X         Y         Z     W + Y
A      0.285896  0.852395  0.975006  0.884853  1.260902
B      0.359508  0.598859  0.354796  0.340190  0.714303
C      0.178081  0.237694  0.044862  0.505431  0.222943
D      0.376252  0.592805  0.629942  0.142600  1.006194
A + B  0.645404  1.451254  1.329802  1.225044  1.975206

In [96]:
df.drop('Z',axis=1)
#if axix = 0 , menas dropping index
# If axis = 1, means droping column

              W         X         Y     W + Y
A      0.285896  0.852395  0.975006  1.260902
B      0.359508  0.598859  0.354796  0.714303
C      0.178081  0.237694  0.044862  0.222943
D      0.376252  0.592805  0.629942  1.006194
A + B  0.645404  1.451254  1.329802  1.975206

In [97]:
df

              W         X         Y         Z     W + Y
A      0.285896  0.852395  0.975006  0.884853  1.260902
B      0.359508  0.598859  0.354796  0.340190  0.714303
C      0.178081  0.237694  0.044862  0.505431  0.222943
D      0.376252  0.592805  0.629942  0.142600  1.006194
A + B  0.645404  1.451254  1.329802  1.225044  1.975206

In [98]:
df.drop('W + Y',axis=1)

              W         X         Y         Z
A      0.285896  0.852395  0.975006  0.884853
B      0.359508  0.598859  0.354796  0.340190
C      0.178081  0.237694  0.044862  0.505431
D      0.376252  0.592805  0.629942  0.142600
A + B  0.645404  1.451254  1.329802  1.225044

In [99]:
df

              W         X         Y         Z     W + Y
A      0.285896  0.852395  0.975006  0.884853  1.260902
B      0.359508  0.598859  0.354796  0.340190  0.714303
C      0.178081  0.237694  0.044862  0.505431  0.222943
D      0.376252  0.592805  0.629942  0.142600  1.006194
A + B  0.645404  1.451254  1.329802  1.225044  1.975206

## READ THIS ABOUT THE DROP() METHOD AND THE EFFECT OF INPLACE ARGUMENT AFTER SETTING TO TRUE
In the next, i will be using the inplace argument in the drop method on the df dataframe,  
Its effect might not be able to revert, so, checking closely is important.
So, like we've been using the drop method before, we'd notice that, after dropping, i use df to print the dataframe after the drop cell And using the df still print the whole of the df returning the dropped rom or column, 
#Thats because the default value of the inplace argument of the drop method is False, 
#If we set it to throug, i will drop the cell or column mentioned and even add make the effect permanenet
#Parmanenet such that if we use df to print afterward, the dropped cell or column will be all gonesetting the

In [105]:
#iF YOU HAVE READ THE CELL ABOVE, THEN LETS DROP THE a  row  from the default generated dataframe
#So, lets drop the D ROw, such that the row for the dataframe would only remain row A,B,C as from the default generated dataframe
#Then thereafter run the df to see if the D row would still appear 

df.drop('D',axis=0, inplace=True)     
#It is used to create an update on the real dataframe,
#

#####Will come back for this, this inplace  argument is getting difficult to understand.
# or alternatively use: 
#df.drop('W + Y', 1)

In [107]:
df

#With this now, its clear that the effect of the inplace being set to True as been seen
#The row D no longer apear on our default dataframe

              W         X         Y         Z     W + Y
A      0.285896  0.852395  0.975006  0.884853  1.260902
B      0.359508  0.598859  0.354796  0.340190  0.714303
C      0.178081  0.237694  0.044862  0.505431  0.222943
A + B  0.645404  1.451254  1.329802  1.225044  1.975206

In [108]:
#Now Moving forward

#Using the loc method which means LOCATION
# we can select a row by calling its label or by selecting based on its position instead of label 
df.loc['A']

W        0.285896
X        0.852395
Y        0.975006
Z        0.884853
W + Y    1.260902
Name: A, dtype: float64

In [110]:
df.iloc[0] 
#While loc method means location, so take the row or column name
# iloc method menas integer location, so takes the index of the row or column aimed to be called

W        0.285896
X        0.852395
Y        0.975006
Z        0.884853
W + Y    1.260902
Name: A, dtype: float64

In [112]:
df.iloc[np.arange(3)] #Since the np.arange provide a numpy arrange thats ranges from 0 to 2 (n-1 rule)
#THe iloc now returned the index of the value in the arraym i.e 0,1 and 2
#i.e it retuern row index 0, 1 and 2

          W         X         Y         Z     W + Y
A  0.285896  0.852395  0.975006  0.884853  1.260902
B  0.359508  0.598859  0.354796  0.340190  0.714303
C  0.178081  0.237694  0.044862  0.505431  0.222943

In [115]:
df

              W         X         Y         Z     W + Y
A      0.285896  0.852395  0.975006  0.884853  1.260902
B      0.359508  0.598859  0.354796  0.340190  0.714303
C      0.178081  0.237694  0.044862  0.505431  0.222943
A + B  0.645404  1.451254  1.329802  1.225044  1.975206

In [116]:
df.loc[['A','C'],['W','Z']] #thIS IS A convertion we've been using before
#Try understand it by proper looking and comparing its result witht the dataframe in cell before

          W         Z
A  0.285896  0.884853
C  0.178081  0.505431

### Conditional extraction
This is very similar to numpy array conditional extraction

In [51]:
df

          W         X         Y         Z
A -1.613579  1.470714 -1.188018 -0.549746
B -0.940046 -0.827932  0.108863  0.507810
C -0.862227  1.249470 -0.079611 -0.889731
D -0.881798  0.018639  0.237845  0.013549

In [52]:
df>0

       W      X      Y      Z
A  False   True  False  False
B  False  False   True   True
C  False   True  False  False
D  False   True   True   True

In [54]:
df[df>0]

    W         X         Y         Z
A NaN  1.470714       NaN       NaN
B NaN       NaN  0.108863  0.507810
C NaN  1.249470       NaN       NaN
D NaN  0.018639  0.237845  0.013549

In [55]:
df[df['Y']>0]

          W         X         Y         Z
B -0.940046 -0.827932  0.108863  0.507810
D -0.881798  0.018639  0.237845  0.013549

In [56]:
df[df['Y']>0]['X']

B   -0.827932
D    0.018639
Name: X, dtype: float64

In [57]:
df[df['Y']>0][['Y','Z']]

          Y         Z
B  0.108863  0.507810
D  0.237845  0.013549

In [60]:
df[(df['Y']>0) & (df['Z'] < 0.5)]

          W         X         Y         Z
D -0.881798  0.018639  0.237845  0.013549

In [61]:
df

          W         X         Y         Z
A -1.613579  1.470714 -1.188018 -0.549746
B -0.940046 -0.827932  0.108863  0.507810
C -0.862227  1.249470 -0.079611 -0.889731
D -0.881798  0.018639  0.237845  0.013549

In [63]:
df.tail(2)

          W         X         Y         Z
C -0.862227  1.249470 -0.079611 -0.889731
D -0.881798  0.018639  0.237845  0.013549

## 3. Missing variables

In [64]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [67]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [68]:
df.dropna() # by default axis=0,   # this is similar to df[complete.cases(df),] in R

     A    B  C
0  1.0  5.0  1

In [69]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [72]:
df.fillna('new value')

           A          B  C
0          1          5  1
1          2  new value  2
2  new value  new value  3

In [73]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [74]:
df['A'].mean()

1.5

In [75]:
df['A'].fillna(value=df['A'].mean()) # filling the value with the mean of a column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64


## 4. Operations

In [76]:
df = pd.DataFrame({'names': 'PJ PJ TJ MJ'.split() ,
                   'GPA': [4,4,3.8,3.5]}, index='A B C D'.split())
df

  names  GPA
A    PJ  4.0
B    PJ  4.0
C    TJ  3.8
D    MJ  3.5

In [77]:
df.head(3)

  names  GPA
A    PJ  4.0
B    PJ  4.0
C    TJ  3.8

In [78]:
df.tail(1)

  names  GPA
D    MJ  3.5

In [79]:
# Unique Values
df['names'].unique()

array(['PJ', 'TJ', 'MJ'], dtype=object)

In [82]:
# number of unique values
df['GPA'].nunique()

3

In [83]:
df['names'].value_counts()     # this is table(df$names) in R

PJ    2
MJ    1
TJ    1
Name: names, dtype: int64

In [84]:
# Applying Functions
df['GPA'].mean()

3.825

In [85]:
round(df['GPA'].std(), 2)

0.24

In [86]:
df['GPA_100'] = df['GPA'].apply(lambda x: x*25)   # of ocurse we are looking for some special functions not just x*25
df

# or alternatively: df['GPA_100']=list(map(lambda x:x*25 , df['GPA']))

  names  GPA  GPA_100
A    PJ  4.0    100.0
B    PJ  4.0    100.0
C    TJ  3.8     95.0
D    MJ  3.5     87.5

In [87]:
df.columns            # names(df) in R

Index(['names', 'GPA', 'GPA_100'], dtype='object')

In [88]:
df.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [89]:
df.sort_values(by='GPA') #inplace=False by default (what does this mean?)

  names  GPA  GPA_100
D    MJ  3.5     87.5
C    TJ  3.8     95.0
A    PJ  4.0    100.0
B    PJ  4.0    100.0

In [90]:
df.reset_index(inplace=True)

In [91]:
df

  index names  GPA  GPA_100
0     A    PJ  4.0    100.0
1     B    PJ  4.0    100.0
2     C    TJ  3.8     95.0
3     D    MJ  3.5     87.5

In [94]:
df.set_index('index')

      names  GPA  GPA_100
index
A        PJ  4.0    100.0
B        PJ  4.0    100.0
C        TJ  3.8     95.0
D        MJ  3.5     87.5

#### Renaming columns:

In [95]:
df.rename(columns={'GPA_100': 'Normalized GPA'}, inplace=True)

In [96]:
df.head()

  index names  GPA  Normalized GPA
0     A    PJ  4.0           100.0
1     B    PJ  4.0           100.0
2     C    TJ  3.8            95.0
3     D    MJ  3.5            87.5

#### Conditional mutation (creating new variables)
Let's say we want to create a new variable named "is_pass" and is defined as "is_pass"=1 if "GPA">3.6 and 0 otherwise. There are multiple ways to do that:

In [97]:
# let's begin with the hard way!
df['GPA']>3.6

0     True
1     True
2     True
3    False
Name: GPA, dtype: bool

In [98]:
temp=[]
for x in df['GPA']:
    if x>3.6: temp.append('pass') 
    else: temp.append('fail')

df['is_pass']=temp
df

  index names  GPA  Normalized GPA is_pass
0     A    PJ  4.0           100.0    pass
1     B    PJ  4.0           100.0    pass
2     C    TJ  3.8            95.0    pass
3     D    MJ  3.5            87.5    fail

Can we do it in one line? How about using list comprehension?

In [99]:
df['is_pass2'] = ['pass' if x > 3.6 else 'fail' for x in df['GPA']]    
# in R: df <- mutate(df,is_pass = ifelse(GPA>3.5, "pass", "fail"))
df

  index names  GPA  Normalized GPA is_pass is_pass2
0     A    PJ  4.0           100.0    pass     pass
1     B    PJ  4.0           100.0    pass     pass
2     C    TJ  3.8            95.0    pass     pass
3     D    MJ  3.5            87.5    fail     fail

Is there any other way?

In [100]:
df.loc[df['GPA']> 3.6, 'is_pass3'] ='pass'
df.loc[df['GPA']<=3.6, 'is_pass3'] ='fail'
df.head()

  index names  GPA  Normalized GPA is_pass is_pass2 is_pass3
0     A    PJ  4.0           100.0    pass     pass     pass
1     B    PJ  4.0           100.0    pass     pass     pass
2     C    TJ  3.8            95.0    pass     pass     pass
3     D    MJ  3.5            87.5    fail     fail     fail

## 5. Data import and export

In [ ]:
pd.read_csv()

In [101]:
# reading from CSV file
df = pd.read_csv('GDP.csv')   # reading excel files: pd.read_excel('GDP.xlsx',sheetname='Sheet1')
df.tail(5)

           DATE        GDP
285  2018-04-01  20510.177
286  2018-07-01  20749.752
287  2018-10-01  20897.804
288  2019-01-01  21098.827
289  2019-04-01  21339.121

In [102]:
# Writing to CSV file
df.to_csv('GDP_new.csv',index=False)   # writing to excel files: df.to_excel('GDP.xlsx',sheet_name='raw data')

In [103]:
df.to_excel('GDP.xlsx',sheet_name='raw data', index=False)